Tekla Open API Reference for Tekla Structures 2025
Frame.Color Property
 The frame's color.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingColors Color { get; set; }
Public Property Color As DrawingColors
	Get
	Set
Property Value
Type: DrawingColors
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when trying to set a non-standard color.
See Also
Reference
Frame Class
Tekla.Structures.Drawing Namespace